test/load-testing/static-endpoint/random-endpoint-1000rps.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 1000
  processor: "./random-endpoint.js"
scenarios:
  - flow:
    - function: "generateRandomEndpoint"
    - get:
<<<<<<< HEAD
        url: "{{ htmlEndpoint }}"
    - get:
        url: "{{ bundleEndpoint }}"
=======
        url: "{{ endpoint }}"
    # - log: "Sent a request to {{ endpoint }}"
>>>>>>> b744a2db102dc187e0253611ff96902405e9ffa5